## Plan Result (883: sbox_ai - TerraformPlanApply)




<pre><code>Plan: 3 to add, 12 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.poc_group_sa_blob_contributor
  * module.ai.azurerm_role_assignment.cog_blob_contributor_to_file_storage_account[0]
  * module.ai.azurerm_role_assignment.ml_blob_contributor_to_ai_storage_account
* Update
  * azurerm_resource_group.rg
  * module.ai.azurerm_ai_foundry.ai_foundry
  * module.ai.azurerm_ai_foundry_project.ai_foundry_project
  * module.ai.azurerm_cognitive_account.cognitive_account
  * module.ai.azurerm_machine_learning_workspace.ml_workspace
  * module.ai.azurerm_private_endpoint.cognitive_private_endpoint
  * module.ai.azurerm_private_endpoint.foundry_private_endpoint
  * module.ai.azurerm_private_endpoint.ml_private_endpoint
  * module.ai.azurerm_storage_account.workspace_storage_account
  * module.application_insights.azurerm_application_insights.this
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.key_vault.azurerm_key_vault.kv




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id         = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox"
        name       = "dlrm-ingest-ai-sbox"
      ~ tags       = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-06-20"
        } -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.poc_group_sa_blob_contributor will be created
  + resource "azurerm_role_assignment" "poc_group_sa_blob_contributor" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "a0e75592-f51f-46c3-84ef-df609b08eb68"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00sftpsbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_ai_foundry.ai_foundry will be updated in-place
  ~ resource "azurerm_ai_foundry" "ai_foundry" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ai-foundry-sbox"
        name                           = "dlrm-ingest-ai-foundry-sbox"
      ~ tags                           = {
          - "__SYSTEM__AIServices_dlrm-techspike-ai-services"           = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.CognitiveServices/accounts/dlrm-techspike-ai-services"
          - "__SYSTEM__AzureOpenAI_dlrm-techspike-ai-services_aoai"     = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.CognitiveServices/accounts/dlrm-techspike-ai-services"
          - "__SYSTEM__CognitiveService_dlrmingestcognitiveaccountsbox" = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.CognitiveServices/accounts/dlrm-ingest-cognitive-account-sbox"
          - "application"                                               = "dlrm-data-ingest"
          - "builtFrom"                                                 = "hmcts/dlrm-data-ingest-infra"
          - "businessArea"                                              = "cross-cutting"
          - "criticality"                                               = "Low"
          - "environment"                                               = "sandbox"
          - "expiresAfter"                                              = "2025-06-20"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_ai_foundry_project.ai_foundry_project will be updated in-place
  ~ resource "azurerm_ai_foundry_project" "ai_foundry_project" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-project-sbox"
        name                           = "dlrm-ingest-project-sbox"
      ~ tags                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-06-20"
        } -> (known after apply)
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ai.azurerm_cognitive_account.cognitive_account will be updated in-place
  ~ resource "azurerm_cognitive_account" "cognitive_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.CognitiveServices/accounts/dlrm-ingest-cognitive-account-sbox"
        name                               = "dlrm-ingest-cognitive-account-sbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-06-20"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

      - network_acls {
          - default_action = "Allow" -> null
          - ip_rules       = [
              - "20.3.165.95",
            ] -> null
            # (1 unchanged attribute hidden)

          - virtual_network_rules {
              - ignore_missing_vnet_service_endpoint = false -> null
              - subnet_id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox" -> null
            }
        }

        # (1 unchanged block hidden)
    }

  # module.ai.azurerm_machine_learning_workspace.ml_workspace will be updated in-place
  ~ resource "azurerm_machine_learning_workspace" "ml_workspace" {
        id                             = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.MachineLearningServices/workspaces/dlrm-ingest-ml-workspace-sbox"
        name                           = "dlrm-ingest-ml-workspace-sbox"
      ~ tags                           = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-06-20"
        } -> (known after apply)
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_private_endpoint.cognitive_private_endpoint will be updated in-place
  ~ resource "azurerm_private_endpoint" "cognitive_private_endpoint" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-cognitive-account-pe-sbox"
        name                          = "dlrm-ingest-cognitive-account-pe-sbox"
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-06-20"
        } -> (known after apply)
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_private_endpoint.foundry_private_endpoint will be updated in-place
  ~ resource "azurerm_private_endpoint" "foundry_private_endpoint" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ai-foundry-pe-sbox"
        name                          = "dlrm-ingest-ai-foundry-pe-sbox"
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-06-20"
        } -> (known after apply)
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_private_endpoint.ml_private_endpoint will be updated in-place
  ~ resource "azurerm_private_endpoint" "ml_private_endpoint" {
        id                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Network/privateEndpoints/dlrm-ingest-ml-workspace-pe-sbox"
        name                          = "dlrm-ingest-ml-workspace-pe-sbox"
      ~ tags                          = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-06-20"
        } -> (known after apply)
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.ai.azurerm_role_assignment.cog_blob_contributor_to_file_storage_account[0] will be created
  + resource "azurerm_role_assignment" "cog_blob_contributor_to_file_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "53a16077-3ab4-49f5-857a-2ac6117b5323"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/ingest00-main-sbox/providers/Microsoft.Storage/storageAccounts/ingest00sftpsbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_role_assignment.ml_blob_contributor_to_ai_storage_account will be created
  + resource "azurerm_role_assignment" "ml_blob_contributor_to_ai_storage_account" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e0dfe660-483a-40d1-aa4d-6e5973f1faa6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Storage/storageAccounts/dlrmingestaisasbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.ai.azurerm_storage_account.workspace_storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "workspace_storage_account" {
        id                                 = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Storage/storageAccounts/dlrmingestaisasbox"
        name                               = "dlrmingestaisasbox"
      ~ tags                               = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-06-20"
        } -> (known after apply)
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.application_insights.azurerm_application_insights.this will be updated in-place
  ~ resource "azurerm_application_insights" "this" {
        id                                    = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Insights/components/dlrm-ingest-ai-appinsights-sbox"
        name                                  = "dlrm-ingest-ai-appinsights-sbox"
      ~ tags                                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-06-20"
        } -> (known after apply)
        # (16 unchanged attributes hidden)
    }

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] will be updated in-place
  ~ resource "azurerm_monitor_activity_log_alert" "main" {
        id                  = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - dlrm-ingest-ai-appinsights-sbox"
        name                = "Application Insights daily cap reached - dlrm-ingest-ai-appinsights-sbox"
      ~ tags                = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-06-20"
        } -> (known after apply)
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.key_vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/df72bb30-d6fb-47bd-82ee-5eb87473ddb3/resourceGroups/dlrm-ingest-ai-sbox/providers/Microsoft.KeyVault/vaults/dlrm-ingest-ai-kv-sbox"
        name                            = "dlrm-ingest-ai-kv-sbox"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2025-06-20"
        } -> (known after apply)
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 3 to add, 12 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":100,"Program":"tfcmt","SHA1":"","Target":"883: sbox_ai - TerraformPlanApply","Vars":{}} -->